app/controllers/repairs_controller.rb

  def index
    @repairs = Repair.all
---
SELECT "repairs".* FROM "repairs" WHERE (oncampus = 't')

  def show
    @repair = Repair.find(params[:id])
---
SELECT "repairs".* FROM "repairs" WHERE "repairs"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @repair = Repair.find(params[:id])
---
SELECT "repairs".* FROM "repairs" WHERE "repairs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @repair = Repair.new(params[:repair])

    respond_to do |format|
      if @repair.save
---
INSERT INTO "repairs" ("created_at", "day", "device", "email", "issue", "location", "name", "number", "oncampus", "opsystem", "otherdevice", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @repair = Repair.find(params[:id])
    @repair.destroy
---
SELECT "repairs".* FROM "repairs" WHERE "repairs"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "repairs" WHERE "repairs"."id" = ?  [["id", 3]]